<template>Exception500
  <div>
    <h2>AI视唱练耳平台使用说明</h2>
    <h2>一、功能概述</h2>
    <span> AI视唱练耳是一个专为中央民族大学音乐学院设计打造的音乐知识学习平台，学生通过注册账号后，可以在平台中进行视唱和练耳题目的练习，后台AI系统会根据学生提交的内容进行机器打分。
      平台题库主要分为视唱和练耳两部分，视唱部分要求学生根据乐谱唱出对应的曲目。练耳部分要求学生根据听到的音频选择正确的乐谱。
    </span>
    <h2>二、注册流程</h2>
    <h3>1. 获取对应学号的验证码：</h3>
    <span>首次使用平台需要进行账号注册，注册成功后即可以使用学号和密码登录系统。</span>
    <span>根据管理员提供的清单查看用户信息和对应的五位验证码，例：</span>
    <img src="/help/fig1.png" alt="">
    <span>李崇明同学的学号为22020930,验证码为847de</span>

    <h3>2. 在系统中激活账号：</h3>
    <span>使用电脑打开平台地址https://musicmuc.chimusic.net/，显示登录页面，如图二。</span>
    <img src="/help/fig2.png" alt="">
    <span>点击账号激活按钮，在弹出框（图三）中输入学号与验证码进行验证。</span>
    <img src="/help/fig3.png" alt="">
    <span>验证通过后进行设置个人密码，设置密码时至少包含8位，请牢记个人密码，系统不会明文保存个人密码，所以如果忘记密码只能进行密码重置而无法进行找回。（如忘记个人密码请联系管理员）</span>
    <img src="/help/fig4.png" alt="">
    <h3>3. 登录账号</h3>
    <span>成功激活账号后，就可以在登录界面使用学号和密码进行登录。一个账号只需要激活一次，每次登录直接使用学号密码登录即可。</span>

    <h2>三、功能说明</h2>

    <h3>1. 首页功能</h3>
    <span>账号登录后即会进入首页，如图所示。</span>
    <img src="/help/fig5.png" alt="">
    <span>本题库中的题目包含八个课次，每个课次一套题目即视唱+练耳。学生用户应从课次一开始做题，并在题库截止日期之前提交作业。</span>

    <h3>2. 视唱题目（核心功能）</h3>
    <span>每一套视唱题目都包含三道题，分别是单声部精唱、单声部视谱即唱和双声部视唱。每道题都要求学生根据乐谱录制对应的音频。</span>
    <img src="/help/fig6.png" alt="">
    <span>视唱三道题中的两道单声部的题目由学生个人录制并上传，双声部的题目要求学生寻找一位搭档组会录制上传。</span>
    <img src="/help/fig7.png" alt="">
    <span>进入对应题目后可以查看题目基础信息，包含演唱信息和范例音、节拍器音频。</span>
    <img src="/help/fig8.png" alt="">
    <span>学习完乐谱知识之后可以利用录制器进行音频录制。其中录制器右上角悬浮按钮可以使录制全屏拖动。点击话筒按钮即可进行录制，可以多次录制，并在最终选择最满意的一组音频在右下角进行提交（注意：录制器在第一次录制时会向浏览器申请录音权限，请同意使用，否则无法进行音频录制。题目一旦提交后就确定答案，无法重复提交同一道题。）</span>
    <img src="/help/fig9.png" alt="">

    <h3>3. 练耳题目（核心功能）</h3>
    <span>每一套练耳选择题题目包含七组题，每组题目对应不同的知识点。</span>
    <img src="/help/fig10.png" alt="">
    <span>选择题目进入后进行选择题答题，并在选择完成后进行提交。</span>
    <img src="/help/fig11.png" alt="">

    <h3>4. 个人页面</h3>
    <span>个人页面包含个人中心和个人设置两个页面，个人中心主要用来查看个人信息和提交的历史记录。个人设置界面目前只有两项个性设置。</span>
    <img src="/help/fig10.png" alt="">
    <span>选择题目进入后进行选择题答题，并在选择完成后进行提交。</span>
    <img src="/help/fig11.png" alt="">

    <h2>四、规则说明</h2>





  </div>
</template>

<script>
export default {
  name: 'help'
}
</script>

<style scoped>

</style>
